lib/tasks/dev.rake

  task add_admin: :environment do
    Admin.create!(
      email: 'admin@admin.com',
      password: DEFAULT_PASSWORD,
      password_confirmation: DEFAULT_PASSWORD
    )
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  task add_admin_extra: :environment do
    10.times do |i|
      Admin.create!(
        email: Faker::Internet.email,
        password: DEFAULT_PASSWORD,
        password_confirmation: DEFAULT_PASSWORD
      )
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  task add_user: :environment do
    User.create!(
      email: 'user@user.com',
      password: DEFAULT_PASSWORD,
      password_confirmation: DEFAULT_PASSWORD
    )
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  task add_subjects: :environment do
    file_name = 'subjects.txt'
    file_path = File.join(DEFAULT_FILES_PATH, file_name)

    File.open(file_path, 'r').each do |line|
      Subject.create!(description: line.strip)
---
INSERT INTO "subjects" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Acionamentos e controles elétricos"], ["created_at", "2020-10-15 00:09:49.562448"], ["updated_at", "2020-10-15 00:09:49.562448"]]

  task add_questions: :environment do
    Subject.all.each do |subject|
      rand(5..10).times do |i|
        Question.create!(
          description: "#{Faker::Lorem.paragraph}?",
          subject: subject
        )
---
SELECT "subjects".* FROM "subjects"
INSERT INTO "questions" ("description", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)