app/views/admins_backoffice/questions/index.html.erb

SELECT COUNT(*) FROM "questions"
---
<h1><%= Question.model_name.human(count: @questions.count) %></h1>