app/controllers/admins_backoffice/admins_controller.rb

  def index
    @admins = Admin.all.page(params[:page]).per(10)
---
SELECT  "admins".* FROM "admins" LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "admins" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]

  def update
    if @admin.update(params_admin)
      AdminMailer.update_email(current_admin, @admin).deliver_now
---
UPDATE "admins" SET "email" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["email", "bernarda@effertz-schuster.org.br"], ["encrypted_password", "$2a$12$YFavxnN.fUiaffjp3LU6neZQ/ogtFC/EJmFVqLovz69hhKbqduC6a"], ["updated_at", "2020-10-13 18:42:26.290591"], ["id", 2]]
UPDATE "admins" SET "email" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["email", "bernarda@effertz-schuster.org.br"], ["updated_at", "2020-10-14 16:40:18.561515"], ["id", 2]]

  def create
    @admin = Admin.new(params_admin)
    if @admin.save
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def destroy
    if @admin.destroy
---
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 12]]