app/controllers/admins_backoffice/questions_controller.rb

SELECT  "questions".* FROM "questions" ORDER BY "questions"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "questions" ORDER BY "questions"."description" ASC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]
---
    def index
      @questions = Question.includes(:subject)
                           .order(:description)
                           .page(params[:page]).per(25)

UPDATE "questions" SET "subject_id" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["subject_id", 181], ["updated_at", "2020-10-15 14:54:51.380080"], ["id", 1410]]
---
    def update
      if @question.update(params_question)

INSERT INTO "questions" ("description", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "saasudsahu salasdlads dsakdjj?"], ["subject_id", 58], ["created_at", "2020-10-15 14:55:31.019075"], ["updated_at", "2020-10-15 14:55:31.019075"]]
---
    def create
      @question = Question.new(params_question)
      if @question.save