app/controllers/admins_backoffice/subjects_controller.rb

    def index
      respond_to do |format|
        format.html {@subjects = Subject.all.order(:description).page(params[:page]).per(25)}
---
SELECT  "subjects".* FROM "subjects" ORDER BY "subjects"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "subjects" ORDER BY "subjects"."description" ASC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]

    def destroy
      if @subject.destroy
---
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 6]]