app/views/admins_backoffice/subjects/index.html.erb

SELECT COUNT(*) FROM "subjects"
---
<h1><%= Subject.model_name.human(count: @subjects.count) %></h1>