app/views/admins_backoffice/admins/index.html.erb

<h1><%= Admin.model_name.human(count: @admins.count) %></h1>
---
SELECT COUNT(*) FROM "admins"
SELECT "admins".* FROM "admins"